# Chapter 7

### Data Cleaning and Preparation

### 7.1 Handling Missing Data

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [5]:
from numpy import nan as NA

In [6]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [7]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
###This is equivalent to:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
### With DataFrame objects, things are a bit more complex. You may want to drop rows or columns that are all NA or only those containing any NAs. dropna by default drops any row containing a missing value:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
### Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
### To drop columns in the same way, pass axis=1: 
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.938976       NaN       NaN
1  0.832593       NaN       NaN
2  0.749058       NaN  0.755365
3  0.010296       NaN  0.009359
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

In [19]:
df.dropna()

          0         1         2
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

In [20]:
df.dropna(thresh=2)

          0         1         2
2  0.749058       NaN  0.755365
3  0.010296       NaN  0.009359
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

### Filling In Missing Data

In [21]:
df.fillna(0)

          0         1         2
0 -0.938976  0.000000  0.000000
1  0.832593  0.000000  0.000000
2  0.749058  0.000000  0.755365
3  0.010296  0.000000  0.009359
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

In [22]:
### Calling fillna with a dict, you can use a different fill value for each column:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.938976  0.500000  0.000000
1  0.832593  0.500000  0.000000
2  0.749058  0.500000  0.755365
3  0.010296  0.500000  0.009359
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

In [23]:
### fillna returns a new object, but you can modify the existing object in-place:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.938976  0.000000  0.000000
1  0.832593  0.000000  0.000000
2  0.749058  0.000000  0.755365
3  0.010296  0.000000  0.009359
4 -1.461062  1.788708  1.737506
5 -1.367359 -1.068401 -0.066270
6 -0.280371 -1.515844 -1.044842

In [24]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.014991 -0.226216  0.738969
1  0.153100  1.569787 -0.053299
2  1.238369       NaN  1.091030
3  1.877069       NaN -0.608701
4  1.360328       NaN       NaN
5 -0.037450       NaN       NaN

In [25]:
df.fillna(method='ffill')

          0         1         2
0 -0.014991 -0.226216  0.738969
1  0.153100  1.569787 -0.053299
2  1.238369  1.569787  1.091030
3  1.877069  1.569787 -0.608701
4  1.360328  1.569787 -0.608701
5 -0.037450  1.569787 -0.608701

In [26]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.014991 -0.226216  0.738969
1  0.153100  1.569787 -0.053299
2  1.238369  1.569787  1.091030
3  1.877069  1.569787 -0.608701
4  1.360328       NaN -0.608701
5 -0.037450       NaN -0.608701

In [27]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 7.2 Data Transformation

Removing Duplicates

In [28]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)

In [32]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [34]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [35]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [36]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

In [37]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [38]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [44]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [45]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),index=['Ohio', 'Colorado', 'New York'],columns=['one', 'two', 'three', 'four'])

In [46]:
transform = lambda x: x[:4].upper()

In [47]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [48]:
data.index = data.index.map(transform)

In [49]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [50]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [51]:
data.rename(index={'OHIO': 'INDIANA'},columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [52]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [53]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [54]:
bins = [18, 25, 35, 60, 100]

In [55]:
cats = pd.cut(ages, bins)

In [56]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [57]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [58]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [59]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [60]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [61]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [62]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [63]:
data = np.random.rand(20)

In [64]:
pd.cut(data, 4, precision=2)

[(0.13, 0.34], (0.13, 0.34], (0.56, 0.77], (0.13, 0.34], (0.13, 0.34], ..., (0.56, 0.77], (0.56, 0.77], (0.77, 0.99], (0.77, 0.99], (0.34, 0.56]]
Length: 20
Categories (4, interval[float64, right]): [(0.13, 0.34] < (0.34, 0.56] < (0.56, 0.77] < (0.77, 0.99]]

In [65]:
data = np.random.randn(1000) # Normally distributed

In [66]:
cats = pd.qcut(data, 4) # Cut into quartiles
cats

[(0.00896, 0.672], (-0.653, 0.00896], (0.00896, 0.672], (0.672, 3.182], (-2.6599999999999997, -0.653], ..., (-0.653, 0.00896], (-2.6599999999999997, -0.653], (0.00896, 0.672], (0.00896, 0.672], (-0.653, 0.00896]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.6599999999999997, -0.653] < (-0.653, 0.00896] < (0.00896, 0.672] < (0.672, 3.182]]

In [67]:
pd.value_counts(cats)

(-2.6599999999999997, -0.653]    250
(-0.653, 0.00896]                250
(0.00896, 0.672]                 250
(0.672, 3.182]                   250
dtype: int64

In [68]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.00896, 1.237], (-1.205, 0.00896], (0.00896, 1.237], (0.00896, 1.237], (-1.205, 0.00896], ..., (-1.205, 0.00896], (-2.6599999999999997, -1.205], (0.00896, 1.237], (0.00896, 1.237], (-1.205, 0.00896]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.6599999999999997, -1.205] < (-1.205, 0.00896] < (0.00896, 1.237] < (1.237, 3.182]]

### Detecting and Filtering Outliers

In [69]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046178     0.022426    -0.001815     0.043517
std       1.037961     0.977616     0.979651     0.964411
min      -2.965010    -2.819859    -3.197467    -2.965068
25%      -0.758046    -0.591750    -0.670264    -0.616748
50%      -0.059539     0.033355     0.036116     0.029140
75%       0.616055     0.668205     0.646034     0.705728
max       3.614881     3.525855     3.028564     2.882460

In [70]:
col = data[2]
col[np.abs(col) > 3]

569    3.028564
671   -3.060299
700    3.017241
791   -3.197467
Name: 2, dtype: float64

In [71]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
243  3.395163 -0.596745  0.135510 -1.534451
472  0.373444  3.525855  1.711026  1.121403
482 -0.248527  3.375872  0.212592  1.270160
563  3.221825  0.054434  0.241452 -0.376202
569 -1.641480  0.722222  3.028564  1.286924
671 -0.929950 -0.411162 -3.060299  0.014961
700  0.445312 -0.202748  3.017241 -0.008832
743  3.303184 -0.724318 -1.158167  1.186962
791 -0.106087  1.622048 -3.197467  0.092642
999  3.614881 -0.422719 -0.202234 -0.490305

In [72]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.047713     0.021524    -0.001603     0.043517
std       1.033114     0.974648     0.978698     0.964411
min      -2.965010    -2.819859    -3.000000    -2.965068
25%      -0.758046    -0.591750    -0.670264    -0.616748
50%      -0.059539     0.033355     0.036116     0.029140
75%       0.616055     0.668205     0.646034     0.705728
max       3.000000     3.000000     3.000000     2.882460

In [73]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0  1.0
1 -1.0  1.0  1.0  1.0
2  1.0 -1.0 -1.0  1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0  1.0  1.0

### Permutation and Random Sampling

In [74]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 2, 0])

In [75]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [76]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
0   0   1   2   3

In [77]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [78]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
2   -1
3    6
4    4
4    4
1    7
0    5
4    4
2   -1
4    4
dtype: int64

### Computing Indicator/Dummy Variables

In [79]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [80]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [82]:
mnames = ['movie_id', 'title', 'genres']

In [83]:
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',header=None, names=mnames)

/var/folders/26/nhlrw59x2f1d6s6ljr___mm40000gp/T/ipykernel_56527/668779004.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('datasets/movielens/movies.dat', sep='::',header=None, names=mnames)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/movielens/movies.dat'

In [84]:
movies[:10]

NameError: name 'movies' is not defined

In [85]:
all_genres = []

In [86]:
for x in movies.genres:all_genres.extend(x.split('|'))

NameError: name 'movies' is not defined

In [87]:
genres = pd.unique(all_genres)

In [88]:
genres

array([], dtype=float64)

In [89]:
zero_matrix = np.zeros((len(movies), len(genres)))

NameError: name 'movies' is not defined

In [90]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

NameError: name 'zero_matrix' is not defined

In [91]:
gen = movies.genres[0]

NameError: name 'movies' is not defined

In [92]:
gen.split('|')

NameError: name 'gen' is not defined

In [93]:
dummies.columns.get_indexer(gen.split('|'))

NameError: name 'gen' is not defined

In [96]:
for i, gen in enumerate(movies.genres):indices = dummies.columns.get_indexer(gen.split('|'))dummies.iloc[i, indices] = 1

SyntaxError: invalid syntax (2435727831.py, line 1)

In [97]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

NameError: name 'movies' is not defined

In [98]:
movies_windic.iloc[0]

NameError: name 'movies_windic' is not defined

In [99]:
np.random.seed(12345)

In [100]:
values = np.random.rand(10)

In [101]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [102]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [103]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

### 7.3 String Manipulation

### String Object Methods

In [104]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [106]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [107]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [108]:
'::'.join(pieces)

'a::b::guido'

In [109]:
'guido' in val

True

In [110]:
val.index(',')

1

In [112]:
val.find(':')

-1

In [113]:
val.index(':')

ValueError: substring not found

In [114]:
val.count(',')

2

In [115]:
val.replace(',', '::')

'a::b::  guido'

In [116]:
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [117]:
import re

In [118]:
text = "foo bar\t baz \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [120]:
regex = re.compile('\s+')

In [121]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [122]:
regex.findall(text)

[' ', '\t ', ' \t']

In [124]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [125]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [126]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [127]:
m = regex.search(text)
m

In [128]:
text[m.start():m.end()]

'dave@google.com'

In [129]:
print(regex.match(text))

None

In [130]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [131]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [132]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [133]:
m = regex.match('wesm@bright.net')

In [134]:
m.groups()

('wesm', 'bright', 'net')

In [135]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [136]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [137]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com','Rob': 'rob@gmail.com', 'Wes': np.nan}

In [138]:
data = pd.Series(data)

In [139]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [140]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [141]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [142]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [143]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [144]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [145]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [146]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [147]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [ ]:
############ Chapter & Completed #################